BaseMain/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Uref                 10.0;
Zref                 82;
zDir                 (0 1 0);
flowDir              (1 0 0);
z0                   uniform 0.015;
zGround              uniform -80.0;
value                $internalField;

// ************************************************************************* //
